DataProcessors/FrontOfficeВыборЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<DataProcessor>
		<Properties>
			<Name>FrontOfficeВыборЗначения</Name>
			<Comment>Выбор значения в Front-office режиме</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>v8:ValueTable</v8:Type>
						<v8:Type>v8:ValueTree</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/FrontOfficeВыборЗначения/Ext/ObjectModule.bsl
// Функция выбора значения из списка.
//
// Параметры:
//	Значение - ЭлементСпискаЗначений. Значение по умолчанию;
//	Подсказка - Строка. Заголовок формы выбора;
//	СписокЗначений - СписокЗначений. Список значений из которого осуществляется выбор значения.
//	Колонки - Строка. Перечень отображаемых колонок списка.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществления выбор значения;
//  Значение - ЭлементСпискаЗначений. Выбранное значение.
//
//Функция ВыборИзСпискаЗначений(Значение = Неопределено, Подсказка = "", СписокЗначений) Экспорт
//Костенюк Александр-Старт 12.06.2012
Функция ВыборИзСпискаЗначений(Значение = Неопределено, Подсказка = "", СписокЗначений, Колонки = "") Экспорт
//Костенюк Александр-Финиш 12.06.2012
	
	// Значение по умолчанию.
	ЭтотОбъект.Значение = Значение;
	ЭтотОбъект.Данные = СписокЗначений;
	//Костенюк Александр-Старт 12.06.2012
	ЭтотОбъект.Колонки = Колонки;
	//Костенюк Александр-Финиш 12.06.2012
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево")) Тогда
		Значение = ЭтотОбъект.Значение;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВыборИзСпискаЗначений()

// Функция выбора значения из таблицы значений.
//
// Параметры:
//	Значение - СтрокаТаблицыЗначений. Значение по умолчанию;
//	Подсказка - Строка. Заголовок формы выбора;
//	ТаблицаЗначений - ТаблицаЗначений. Таблица значений из которой осуществляется выбор значения;
//	Колонки - Строка. Перечень отображаемых колонок таблицы.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществления выбор значения;
//  Значение - СтрокаТаблицыЗначений. Выбранное значение.
//
Функция ВыборИзТаблицыЗначений(Значение = Неопределено, Подсказка = "", ТаблицаЗначений, Колонки = "") Экспорт
	
	// Значение по умолчанию.
	ЭтотОбъект.Значение = Значение;
	ЭтотОбъект.Данные = ТаблицаЗначений;
	ЭтотОбъект.Колонки = Колонки;
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево")) Тогда
		Значение = ЭтотОбъект.Значение;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВыборИзТаблицыЗначений()

// Функция выбора значения из дерева значений.
//
// Параметры:
//	Значение - СтрокаДереваЗначений. Значение по умолчанию;
//	Подсказка - Строка. Заголовок формы выбора;
//	ДеревоЗначений - ДеревоЗначений. Дерево значений из которой осуществляется выбор значения;
//	Колонки - Строка. Перечень отображаемых колонок таблицы.
//
// Возвращаемое значение:
//	Булево. Истина - если был осуществления выбор значения;
//  Значение - СтрокаДереваЗначений. Выбранное значение.
//
Функция ВыборИзДереваЗначений(Значение = Неопределено, Подсказка = "", ДеревоЗначений, Колонки = "") Экспорт	
	
	// Значение по умолчанию.
	ЭтотОбъект.Значение = Значение;
	ЭтотОбъект.Данные = ДеревоЗначений;
	ЭтотОбъект.Колонки = Колонки;
	
	// Открываем форму выбора.
	Форма = ЭтотОбъект.ПолучитьФорму("Форма");
	Если Не ПустаяСтрока(Подсказка) Тогда
		Форма.Заголовок = Подсказка;
	КонецЕсли;
	
	// Выбор значения.
	ПараметрЗакрытия = Форма.ОткрытьМодально();
	Если (ТипЗнч(ПараметрЗакрытия) = Тип("Булево")) Тогда
		
		Значение = ЭтотОбъект.Значение;
		
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // ВыборИзДереваЗначений()
